historic/TOSHIBA_HGST_MD04ACA4_xfs/mixed-601-128to256k_10Mseq.fio.out
randread-128k-256k: (g=0): rw=randread, bs=128K-256K/128K-256K/128K-256K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.2.8
Starting 3 processes

randread-128k-256k: (groupid=0, jobs=1): err= 0: pid=5496: Thu Apr  7 15:13:48 2016
  read : io=1699.4MB, bw=28970KB/s, iops=226, runt= 60067msec
    slat (usec): min=4, max=59, avg= 6.58, stdev= 1.71
    clat (usec): min=353, max=404692, avg=44170.55, stdev=42560.42
     lat (usec): min=359, max=404698, avg=44177.25, stdev=42560.48
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    5], 10.00th=[    7], 20.00th=[   10],
     | 30.00th=[   14], 40.00th=[   20], 50.00th=[   29], 60.00th=[   42],
     | 70.00th=[   58], 80.00th=[   77], 90.00th=[  102], 95.00th=[  126],
     | 99.00th=[  196], 99.50th=[  225], 99.90th=[  273], 99.95th=[  281],
     | 99.99th=[  322]
    bw (KB  /s): min=14384, max=43346, per=74.29%, avg=29131.42, stdev=6915.21
    lat (usec) : 500=0.04%, 750=0.01%
    lat (msec) : 2=0.21%, 4=2.04%, 10=18.60%, 20=19.21%, 50=25.53%
    lat (msec) : 100=23.88%, 250=10.28%, 500=0.19%
  cpu          : usr=0.06%, sys=0.18%, ctx=13598, majf=0, minf=329
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=13595/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10
seqread: (groupid=0, jobs=1): err= 0: pid=5497: Thu Apr  7 15:13:48 2016
  read : io=617472KB, bw=10270KB/s, iops=10, runt= 60121msec
    slat (usec): min=13, max=403, avg=24.83, stdev=25.65
    clat (msec): min=1, max=217, avg=63.17, stdev=40.84
     lat (msec): min=1, max=217, avg=63.20, stdev=40.84
    clat percentiles (usec):
     |  1.00th=[ 1880],  5.00th=[ 2224], 10.00th=[ 3184], 20.00th=[19840],
     | 30.00th=[43776], 40.00th=[57088], 50.00th=[67072], 60.00th=[74240],
     | 70.00th=[79360], 80.00th=[88576], 90.00th=[109056], 95.00th=[134144],
     | 99.00th=[187392], 99.50th=[199680], 99.90th=[216064], 99.95th=[216064],
     | 99.99th=[216064]
    bw (KB  /s): min= 1204, max=24632, per=26.40%, avg=10353.56, stdev=3399.88
    lat (msec) : 2=3.98%, 4=7.63%, 10=2.65%, 20=5.80%, 50=13.27%
    lat (msec) : 100=53.57%, 250=13.10%
  cpu          : usr=0.02%, sys=0.02%, ctx=1051, majf=0, minf=528
  IO depths    : 1=71.0%, 2=6.3%, 4=12.6%, 8=10.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=603/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10
seqwrite: (groupid=0, jobs=1): err= 0: pid=5498: Thu Apr  7 15:13:48 2016
  write: io=616448KB, bw=10273KB/s, iops=10, runt= 60005msec
    slat (usec): min=24, max=68, avg=45.65, stdev= 9.43
    clat (msec): min=1, max=183, avg=71.87, stdev=46.88
     lat (msec): min=2, max=183, avg=71.92, stdev=46.88
    clat percentiles (usec):
     |  1.00th=[ 1976],  5.00th=[ 2096], 10.00th=[ 2512], 20.00th=[14400],
     | 30.00th=[54016], 40.00th=[67072], 50.00th=[74240], 60.00th=[81408],
     | 70.00th=[90624], 80.00th=[105984], 90.00th=[138240], 95.00th=[156672],
     | 99.00th=[177152], 99.50th=[183296], 99.90th=[183296], 99.95th=[183296],
     | 99.99th=[183296]
    bw (KB  /s): min= 1253, max=26499, per=100.00%, avg=10343.98, stdev=3375.00
    lat (msec) : 2=2.33%, 4=14.45%, 10=1.83%, 20=2.66%, 50=6.64%
    lat (msec) : 100=49.00%, 250=23.09%
  cpu          : usr=0.04%, sys=0.02%, ctx=1026, majf=0, minf=11
  IO depths    : 1=66.6%, 2=7.3%, 4=14.6%, 8=11.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=602/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: io=2302.4MB, aggrb=39214KB/s, minb=10270KB/s, maxb=28970KB/s, mint=60067msec, maxt=60121msec
  WRITE: io=616448KB, aggrb=10273KB/s, minb=10273KB/s, maxb=10273KB/s, mint=60005msec, maxt=60005msec

Disk stats (read/write):
  sda: ios=14292/647, merge=0/3, ticks=642886/45402, in_queue=688709, util=99.87%